Tekla.Structures.DialogInternal.ProfileAttributeRequestHandler
For internal use only !
Profile attributes request handler

Tekla.Structures.DialogInternal.ProfileAttributeRequestHandler.#ctor
Initializes a new instance of the Tekla.Structures.DialogInternal.ProfileAttributeRequestHandler class.

Tekla.Structures.DialogInternal.ProfileAttributeRequestHandler.AttributeRequestedEvent
The attribute requested event

Tekla.Structures.DialogInternal.ProfileAttributeRequestHandler.OnAttributeRequestedEvent(Tekla.Structures.DialogInternal.IDialogOwner,System.String,System.Int32)
The attribute requested event
handle: Caller control
profile: Profile name
flag: Flag dummy

Tekla.Structures.DialogInternal.ProfileAttributeRequestHandler.Dispose
Dispose this instance